org/human_behaviour_as_optimal_control.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: Human Behaviour As Optimal Control

Does [[file:reinforcement_learning.org][Reinforcement Learning ⭐]] and [[file:optimal_control.org][Optimal Control]] provide a
reasonable model of human behaviour? Is there a better explanation?

For example, is the gait of a human being optimizing for a certain
objective?

If we assume that the policy maximizes the expectation of total
reward under some given dynamics, can we learn the human reward
function from the data?

We can model sub-optimal behaviour using techniques from graphical
models ([[file:control_as_inference.org][Control As Inference]]), and use this framework to derive new
"soft" RL algorithms (keywords: soft optimality).

* Resources
- [[https://www.youtube.com/watch?v=Pei6G8_3r8I&list=PLkFD6_40KJIwhWJpGazJ9VSj9CFMkb79A&index=13][CS285 Fa19 10/16/19 - YouTube]]
